Revit 2027 API
Transform.OfVector Method
Applies the transform to the vector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ OfVector(
	XYZ vec
)
Public Function OfVector (
	vec As XYZ
) As XYZ
public:
XYZ^ OfVector(
	XYZ^ vec
)
member OfVector :
        vec : XYZ -> XYZ
Parameters
vec XYZ
The vector to be transformed
Return Value
XYZ
The new vector after transform
Remarks
 Transformation of a vector is not affected by the translational part of the transformation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace